import { Grid, Typography } from '@mui/material';
import { Bullet, Section } from 'components';

const Skills = () => (
    <Section id="skills">
        <Grid container spacing={10}>
            <Grid item>
                <Typography variant="h2">Что я умею</Typography>
            </Grid>
            <Grid item container spacing={6}>
                <Grid item md={6}>
                    <Bullet title="Планировать">
                        Определяю целевую аудиторию, формулирую цели и способы
                        их достижения, разрабатываю план реализации выбранных
                        способов.
                    </Bullet>
                </Grid>
                <Grid item md={6}>
                    <Bullet title="Оформлять">
                        Самостоятельно или с привлечением дизайнеров оформляю
                        страницы в соответствии с корпоративным стилем, добавляю
                        необходимые элементы (описания, ссылки, фото и пр.).
                    </Bullet>
                </Grid>
                <Grid item md={6}>
                    <Bullet title="Наполнять">
                        Составляю контент-план, в котором определены рубрики,
                        темы, периодичность и частоту постов, соотношение
                        информационных и рекламных постов. Самостоятельно, либо
                        с помощью копирайтеров пишу материалы.
                    </Bullet>
                </Grid>
                <Grid item md={6}>
                    <Bullet title="Привлекать">
                        Использую наиболее подходящие способы привлечения
                        целевой аудитории. Здесь нужно текста дописать, не знаю
                        что еще здесь полезного и умного написать.
                    </Bullet>
                </Grid>
                <Grid item md={6}>
                    <Bullet title="Мониторить">
                        Отслеживаю, что пишут о компании вне страниц бренда — в
                        других группах и сообществах. По итогам корректирую
                        стратегию ведения аккаунта.
                    </Bullet>
                </Grid>
                <Grid item md={6}>
                    <Bullet title="Анализировать">
                        Использую внутренние аналитические инструменты соцсетей.
                        По итогам аналитики корректирую ведение аккаунта.
                    </Bullet>
                </Grid>
            </Grid>
        </Grid>
    </Section>
);

export default Skills;
